Netology/src/DataProcessors/УстановкаЦенПродажи/УстановкаЦенПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаЦенПродажи</name>
</mdclass:DataProcessor>

Netology/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Netology/src/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Module.bsl
&НаСервере
Процедура УстановитьНаСервере()   
	
	ВсяНоменклатураКОбработке = ПолучитьВсюНоменклатуруДляОбработки();
	
	Если ВариантУстановки = 0 Тогда
		
		УстановитьФиксированнуюЦену(ВсяНоменклатураКОбработке);
		
	ИначеЕсли ВариантУстановки = 1 Тогда    
		
		УдалитьНоменклатуру(ВсяНоменклатураКОбработке); 
		
	Иначе
		
		УстановитьПроцентОтЦеныИЗаписать(ВсяНоменклатураКОбработке);
		
	КонецЕсли;

КонецПроцедуры    

&НаСервере
Процедура УстановитьФиксированнуюЦену(ВсяНоменклатураКОбработке)
	
	Для Каждого Строка Из ВсяНоменклатураКОбработке Цикл
		
		МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Строка;
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Цена = ФиксированнаяЦена;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьНоменклатуру(ВсяНоменклатураКОбработке)

	Для Каждого Строка Из ВсяНоменклатураКОбработке Цикл
		
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Строка);    
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры   

&НаСервере 
Процедура УстановитьПроцентОтЦеныИЗаписать(ВсяНоменклатураКОбработке)
	
	Для Каждого Строка Из ВсяНоменклатураКОбработке Цикл

		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(Строка);
		
		Если ПоследняяЦена = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяЦена = ПоследняяЦена * (1 + ПроцентОтТекущейЦены / 100); 
                                    
		УстановитьНовуюЦенуСПроцентом(Строка, НоваяЦена);
		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция НайтиПоследнююЦенуНоменклатуры(Номенклатура)

	ПоследняяЦена = Новый Структура;
	ПоследняяЦена.Вставить("Дата", Дата(1, 1, 1));
	ПоследняяЦена.Вставить("Цена", 0);
	
	НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);     
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл

		Если ПоследняяЦена.Дата > Запись.Период Тогда
			
			Продолжить;
			
		КонецЕсли;

		ПоследняяЦена.Дата = Запись.Период;
		ПоследняяЦена.Цена = Запись.Цена;

	КонецЦикла;
	
	Возврат ПоследняяЦена.Цена;

КонецФункции 

&НаСервере
Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)

	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура); 
	
	Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
		
		ПоследняяЦенаНоменклатуры = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ДатаАктуальности , Отбор);
		
	Иначе
		
		ПоследняяЦенаНоменклатуры = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее( , Отбор);	
			
	КонецЕсли;
	
	Возврат ПоследняяЦенаНоменклатуры.Цена;
	
КонецФункции

&НаСервере
Процедура УстановитьНовуюЦенуСПроцентом(Номенклатура, Цена)

	МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда) 
	
	УстановитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)                     
	
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0); 
	УстановкаДоступностиДляПроцента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                             
	
	УстановкаДоступностиДляПроцента();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаДоступностиДляПроцента()
	
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
	Элементы.ДатаАктуальности.Доступность = (ВариантУстановки = 2);

КонецПроцедуры      



&НаСервере
Функция ПолучитьВсюНоменклатуруДляОбработки()

	ВсяНоменклатураКОбработке = Новый Массив;  
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		
		НоменклатураВСтроке = СтрокаСписка.Номенклатура;
		
		Если НоменклатураВСтроке.ЭтоГруппа Тогда
			
			ДополнитьМассивЭлементамиВложеннымиВГруппу(НоменклатураВСтроке, ВсяНоменклатураКОбработке);
			
		Иначе
			
			ВсяНоменклатураКОбработке.Добавить(НоменклатураВСтроке);
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат ВсяНоменклатураКОбработке;

КонецФункции         

&НаСервере
Процедура ДополнитьМассивЭлементамиВложеннымиВГруппу(ГруппаНоменклатуры, ВсяНоменклатураКОбработке)

	Выборка = Справочники.Номенклатура.Выбрать(ГруппаНоменклатуры); 
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда                                                     
		
			ДополнитьМассивЭлементамиВложеннымиВГруппу(Выборка.Ссылка, ВсяНоменклатураКОбработке); 
			
		Иначе
			
			ВсяНоменклатураКОбработке.Добавить(Выборка.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);  
	ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныВыбор", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры
